using System;
using System.Collections.Generic;
using System.Diagnostics;
using System.IO;
using System.Linq;
using Newtonsoft.Json;
using NUnit.Framework;
using VigenereCipher;

namespace VigenereCipherTests
{
    [TestFixture]
    public class KasiskiExaminationTests
    {
       //// [TestCase("UTPDHUG NYH USVKCG МУСЕ FXL KQIB. WX RKU GI TZN, RLS BHZLXMSNP KDKS; СЕВ Ш HKEWIBA, YYM SRB PER SBS, JV UPL О UVADGR HRRWXF. JV ZTVOOV УН ZCQU У UKWGEB, PL UQFB Р FOUKCG, TBF RQ VHCF R KPG, 0U КЕТ ZCQU MAW QKKW ZGSY, ЕР PGM QKETK UQEB DER EZRN, MCYE, MG UCTESVA, WP КЕТ ZCQU MAW KOIJS, LCOV NTHDNV JPNUJVB Ш GGV RWX ONKCGTHKFL XG VKD, ZJM VG CCI MVGD JPNUJ, RLS EWVKJT ASGUCS MVGD; DDK VG NYH PWUV CCHIIY RD DBQN RWTH PFRWBBI VTTK VCGNTGSF FL IAWU XJDUS, HFP VHSF, RR LAWEY QDFS RVMEES FZB СНН JRTT MVGZP UBZN FD ATIIYRTK WP КЕТ HIVJCI; TBF BLDPWPX RWTH ULAW TG VYCHX KQLJS US DCGCW OPPUPR, VG KFDNUJK GI JIKKC PL KGCJ lAOV KFTR GJFSAW KTZLZES WG RWXWT VWTL WP XPXGG, CJ EPOS VYC BTZCUW XG ZGJQ PMHTRAIBJG WMGEG. JZQ DPB JVYGM ZCLEWXR:CEB lAOV NYH JIKKC TGCWXE UHE JZK. WX VCULD YTTKETK WPKCGVCWIQT PWVY QEBFKKQ, QNH NZTTWIREL IAS VERPE ODJRXGSPTC EKWPTGEES, GMCG TTVVPLTEEJ; YCW WV NYH TZYRWH LOKU MU AWO, KEPM VG BLTP VQN RD DSGG AWKWUKKPL KGCJ, XY GPP KPG ONZTT ICUJCHLSE KET DBQHJTWUG. DYN MVCK ZT MEWCW HTWE ED JL, GPU YAE CH LQ! PGR UE, YH MWPP RXE CDJCGOSE, XMS UZGJQJL, SXVPN HBG!",  6, "English")]
       //// [TestCase("СЪСШ ЩГЖИСЮБЩЫРО ФЧ РЛЫОУУПЦЛЫ ЦЙУБЭЫФСЮДЯ ЛКЧААЮЦЩДХИЯ Б ХЙЕУЖ ШЩ ЧЙХК ЯПУЩА УОРЧЙ ЧЬЩ ЬЙЬЩУЙЙЧ Е ПЛЖЮС ЧАХОИ ЩЦ ЛЩДФСНБЮСЛ Щ ЙККЦЖЦЛЩ ЭЙСНШТ ЩЧЫОВХЮДИ ЗЗН ЛЪЯД ЛЕЖОН ЕЮЧЪЛМСРТЖЦЬВЖ ЛГСЗЙЬЧШ НФЧЗ ЧЮАЮЕ ЛЖЙКУАХЙНАИЕЬВ ЙЦЛ ККФЩУЮИЙЧ З ЬЦСЙВГЫХ СОЗЖЪНШШО ЛЪЯД ЦСЗНКЕШЛГЫХ ЦЩЗШО ЦСПЛЛТП С ЧАХЙВЩ ЮЙЦСЗХФС КЗСАХЦЩ СЙФФЗШО ЛЪЯД РЛЬНГЫХЪЖ ДПХЛЕЗ НФЧГХЛ ШЙ ШУЩ ЮОЕЛХЧУЛУ ЩКЯЙЛЩНКЫЭА ЕЧРЮЗЫГЧЖФЖ ЩЦ ЧРШЙЛЩМ ДЛВОЖЫРО КЙЯЛЫОЖЧЖФПШЙЪНХ ХЙЕЩЖ СЪСШ СЬЛРНГ ШПРТЗПЗН ЧЕЧУЦЖЪЕЩУС РЫСОНШЙ ЩЩТЖЛТЕЗ СЪСПХЛ СПРЬЛЕСЧШЙЪНХЩ ЪЙУЖЫЬЛ ЯЧВАЕЧИ ЩРЩТ ОЕФЖЫХЪЖ ДХЩЩЩХОВХЮДФ ЩРЩТ Щ ЗМУВ ЫЩГЕПЫЛЖПЯЛЩ Е ШУБЭЫЛЯЖ ЛЩДФСНБЮСЖ ШПБВЩ КЛЩА УОРЧЙ С ЛЪЯД Р ЮЯЙЭЩИЙЯЩ ЭЧНЛЯДФ ДЙРЧБЩЫРО ЫФЖ НЖЫФМ ЕРУЛКФТЕЗ У ЬЩУ ЧНШЙЪЖЧКИ ЧЩЫЙЕЧЗАФДЭСФ ЮЙНЭЩСЦТА З СЪСШ РГФПЛТ З ЙЪЬЛЕО ЛР ИОСЩХ АФЧЭЧ ЩЮЯОЧАИОЬШЙО ЦСЙМУБУХЬЛЖ ЪЩНЖЩСБЮСФ НЗНГЯХСЮАКУЛА ЬЙЧБМС Л ГЖФФШПШУБЕФФШЮЧФ ЛЪЬЮАЮСФ НИИ ДЛЯЧЫЛ ЙЩЪБЮСОЛЕЙЬШЙТ СЩЬЦЛ НЖЫФМ Е НФЧКУЩЕ КЙЧК ЮОЩФЦЧЧЩУЧ УБЬЦЩЛЪЩГЖЗО ЛЪЯ ЫГЯ ЭЙЕ ЧЙФПЯЙ ШУЩ ОЫЛР АЪВЛЕСЖР ЪЬЧАХ ЧААКШФЦЖЦГ НЖЫЖЕ ЕЧОЕЙПЬЛКЫП ЩЮЫФСЖЪЬЛТ С РЛЫОУУПЫФТГЦЩМ ЫОЖЧЖФПШЙЪНЩ УЦЩЪЙЧАСПРЛА ХСЦЛЕ ЛЛНЙЛ ЗЛЯХ ЛЪЯ ЦФЩЬКФУЮЧ ЕБЭ ЦФЩЬКФУЮЧ ЯШЙМЩЛЪЩГЖЗО СЩЬЦЛ ЯЙЫЩСАЗ ЩШЗ ЧНСППГЫХ УГЯ ЮОЛЖЪОСШЙ ХЬЛРЧЩФЯЙОЩЖ ЦФДУЧНСД ЦГ ЗЮОЫШЩЗ РРЙПФДХЕ ЛЪЯ ЧЧШЙМЩ ЧЗШГ ЕЙНФТЗ", 4, "Russian")]
       ////  [TestCase("босэоьыыф ачолуз, босэоьыыф къцпэокыацис — ьдун тх мртштон къцпэокыацисо, оьншрынаизифсй ыа ърптпщлшфешит ь сющпятномонуи чутыимцацьчьгщ сьотусьцчрсфьгщ ркяпыеоулрнтн оэдпщьшыя яичвшщон и тг пщсхудщвкаецьчьсэеу шах в шакыыььм эефятр, ткш и н штврщтпшсэе, фьтщршу, с эобыоьтжм дщ зкъешы ыцмнохьв, муоут ьояюашяькск в щюобеыяе гиююоначця у дпжияршраший. бпыогёынщ, чкятщтчйй лнкщит пъудъохоглеь, етщ чкятщтк эоквхунуя содлнчьй муфры ллюовутк р дщсьотщччь дцичыыа тпшсэая ьдша т аа се ощя ыасыыа тпшсэом ьдшонь ятыфо.пыи заоч, в ыщувап ъошокщфлвтанщгш жияршраший, усци м жияршаехсьу бюдпа суммьл ь ачолщгтенщй мурщяьыоьтжм пщямщеший, ао чорыо ърптпщлшфиэь, бао щн т нвцяпаск уфозлнчьй тавцфыомоншоу пухвшч.ашахьгуччйе ыаыяусдпыик пъцмрнймтья ф пиоркъмлм(орумуфрешнеъ пщсхудщвкаецьчьсэяц), аругъомчац ц т.п.в ыщувап эоцикщфлвтанжх вцфыом. ъеэоо еаьтшанщгш шрупььашахцзл исреьтпы с IX нефо (рлбшаы лл-фцнпи), яьтк нкцбщлпу итвпятшыц ялючкум ргш эрумпыеший р ррахкнщй рцзши, мьзчорыо, квхнеэсй тегиююонкк угуппасхия цеыонщияом ф.-ф.гацэоцьшыоч в 1822 ньдю.в ябдщжпятнечыоф лтаеыаьбрр нкцбщлпу итвпятшыцц уъоццнлнтнму ямщяйтын рлсышаты «сьлщтшч жюк» зтглрк эо, «ълйжудип еецомучхи» фьнлн оьйця, к аахжп юочач «теэи фопуткыа оркытл» жищь неъыа.шабцнля ы яеыеоцнж XX впша мохкшуныавщ иыэоцьсбечыя олооъцтчом жияршраший юатркпаэымоюэсй бсэоуеиныцц к ваыаоэншъу хртэтщачолузэ, эоитшъу щн щюичечнеэсй р оьншрнщм м эрщцпяср олбчрнтн бюдэзиа къцпэонюаяом", 5, "Russian")]

       // [TestCase("Оуйэтмче щавчнлеэая э пычёша ю юрфбцчжсншэй фмъурлтычцж Ашьы Ыамъоннё Жеьеы, сдр мё рипич реэь мйсдиф аврт Ъутррлвроа. Збою пычёш ямъяртьн снопсо ьооо эцсъэзфцууй: удпаь шы тьацоччмэя ьэ мщончмф нкчбълпу влжшймф гпяокму яошашо. С прюсох сээрънё, юрфёч нвчяпбск сыудэтмэм баыокюеычсюихч «вжсгугъ олзеэтмо», съпщатлвуыооо ь «гашуьэвэкуы омщпатноч» (О. С. Орупордщр «Гърп эт ямк»), пеуныовэтмунщонэ и чжурооо. Мае ыруухлвгче фщюб вжгщту плй аемя м юочетьыб зшокъмьбвлх, хэтърёу ощи чэгят товрсэч у Деыур. Юах, щнкзй Раэицчя ноцьурт ьвдзбк угъ дпбех, кщбоьыч эн эткяартьн уэтыэиюь мйгъдшйй мркщ, а Прюпевккн пьипцжлеэ яапи ээгъ, чээбж унэвърубь цнйця Наьчлфя ъэхчоъэтлтж ца рё ьйнл. Пщщауаэулзнщш чррээй квцнеюсй яиюукъ пьимутэтмэвлнун нфкщыу ще уцврсэьох и шчкъмю ье щусьох трбудку (гр. ma tante). Щихбо фз нэсюеф ье ункут, цтщ энл ткщак, и шу хъчпб с щеф яаугщраьимотз, нщ ьаьугчтз нпюиэашйе уахэнж смутэкщсо ъбдусювк энф нп ыооуэ. Ьа ыёьбръм яэнр гщатрй Кьнж Шпяеь вётечяибск дмо пррьэнлжк: Онпрпш Бълхэнэкуш и Ыьпя Брзюдон. Ошч пьоэчвъпщатлвцунж вёашрмю авртю, щац Чкекфй ъяоюимэпъсэовчеш «гашуьэвэкщыу ъбдусювю». Почьгчнэтмэ рлзнэвърщр нл эээм мацв пъсмнщрнщ юочиэчкр и няяпудуй нофье э Нкюочещьош, кщбоьонэ нлзёрайт «хэрэихонэкуы чядщриееч». Юрф эээм моцкшфньбвъ дуолъгщр гъсэнмф вптёюсй ьа аркьцязьщош. Нпамътын нл смэи ъбпзащий Почкщьсцочв нр еттиюь х Щуьанчня, Пжур эркцу те ъэсче щбързоо Ащдыуя ътъяанлйутэя эвдл.Ашотълж Щуьанчн — эыш щнкзй Раэицчя Цуыогфнк, тоэткрлкюдчй рмю ынъгщ ьеядщпсюв эум, гтщ юоэтщннщо мудст ыозоуцкняю счзщь у брлтуб дрнжси ътбо.Пъсцу снопсо нотррлщпьик ит - ца оркьивы Ъкеь пщатъяшьо ырщропиэ авъё мяешя м щошпкьиф Кюяаоишо вшеьбе э Дщъобомйм ф дывгфму эффцпяаши.Зба титьь эомурдешьо ще ъэдбоочт Метвхъвю, эбчаооюеечв възмйшрншэй пугэй, поляыш спядвеч ч сыоьэбщоьбяши ьбаюь оуйэтмчтрлжьо нлунтрлжьыш чпъонехэм, ыруьоэиэк пължцу ъбдусювю.Эчррптнже «ъяицлиёещий» Онлтщъя, Ыьпяа ф Дщъобомо злккьчфвкмтэя эум, гтщ энф гоу - тъ ркцдъбёъи тимэгъ мптврдй, ьаыунолф ич ыочоойх лкэяиэ, а хэгпа ъяирхкъа ыоцчцфя уд ущичотз, ошч «пъйчолф кморюацкнъгщ, юрфвйцачи псо эпуьох к чуднеом и ыуьбичи чуднеон в Шофщу; шеорепь ъъанапб, а цвкятллжьых нк ьёш». В убоое, Ъкеь бёъ оюпыовчеш р Мъсхру, Поцэхъв ыозтацэвлн м аочдкбы, л дпъо э Ашотълпы клк - ээ злмйъ еоо щбев. Ит Юеюеыпуьгк техсэрир ппяещоьчтэя м Ыоэкмв нл ичунфнё срлфуьи Ьоьбоноф ч ес дщёеьи Шотлшу.Цдрсж ыы ункщошичая эо маех спыьрй Ыэсюомйх: оркгищеф Ьаюацкех Рщатъвщш, ес мюхеш гыофъм Уъьрй Ыэсюомйм, фх оутзму: Реьоф, Ьицоцоеш, Нкбадеф ч Пртпш, а юаххе ылпыящнуеех гыоффну Аощеф.Эбэткьонкк р срмжу Ръсээвжх ъяоюимэпъсэовчяпбск пычёшу Гуррр: ттеэь мае ырщзе, фсхяещнпш, дъбыуй.Удпаь те товкзёрайтьн дне цмбъвшйе чишчи: Эошн и Щихэллй Ыэсюом, Ьаюаго и Моычс Прюпевкщш. Сънй ч Нфкщъах пёбайтьн сцрёраюь ьроф оэьодешчя ът маеб, ткщ клк уд лйбщрь ще чэжрт ъяинеьби щи х ёешу аэръшпыу, неок Сънй бръюыэдщай аеэтыо Нфкщъак.Нщ Ьицоцой ътъяанлйутэя шо въйшв, и Эошн нр мщхею соуртаэк сноуд счет.Энл иьщррншу пррпхинапб зл нпсо.Ьатсоноы авъеф бръюыэдщоф аеэтый и ъдшэвьечунщо цвчдеф юопрюси эо ьрофм ляаюоч, о тлксу иб пщеечуф рипиэ Ьаюаго Ръсээвл.Ошо тъжп догеэ ъюмиэк къгщ - бо, ыозбошу шопьагчвлеэая ща щбкьомунщыф яаугщроь с Лэрфсщы и вецвею енэ.Пьаттнфк ъяопоцхартьн.Нл нры тлксу пьиьвтэтмвею Пжур Метвхъв, хэтърёш зпеьк зщахэмфтьн с эомаеш юшэй Щаэошрй Ыэсюомэй.Ыруузтапб Млржн Дшиэяирвшо Абрщаишомо — огешк вчийбечьшоя ф уможлечоя тешзища.Ъяацтуёеэку рср пычсятьбвяюдче мойбск ер ца эмпъоэтж ч ррзхэсюь пф сяжоунфй у рыэккцынашчй.Ыркцдщих р слмщы рлзнорр.Гыоф Ьоьбон ткьцяеэ авъй цмбфмёш тлнпе — «Длнуъу Цуъэрл» с Кдръсуыоноф. Р эюо мяешя м Ыоэкму лржуб пьи ьыеьту атлрёш гьая Пеууаэв — нлктечеб эгьочьооо ьэсюойьик и щбев Пжурл.Кшнзз Вкаичиф, нвчяйаь ьооатнешьицоч Пеууаэвл, нкёищапб бържпу уа шосчеоатно.Хяоше шугъ нк ьаэлптсювщ бацжп юрртпьдяюэ щнкжшй Млмщьтъвё, щоюоыйе нмпатр с хьяуеч Раэицчеш Кюяаоишйм квцнююсй аашычч бчитщиши ыэдэтмунщихомф гыофл.В лэрзбю бацжп рмршурартьн и цнйсищя Ояумебщак — мкбь Моычсл.Дпъо ъсцэжщяпбск тпы, чюо м авъёч цанедонфи няаа пужею ичюеьаээря с ъяоэьлэй язкщощиэк Пзеыо(Пзеы нвчяпбск нпцацошьыш сёьош гыофл и луз итщш пьобудярё ье шосут ыоцвчфтж ьаэлптсювщ) ч злвпзарт маё рмю.Юллн хьяуя Мосфлун съсээию в ээм, гтщпы януётъжубь уамущлнуу и нср ьаэлптсювщ юопецчтз мпхдя смэиш спыехсэрош и хьятнкыи.Вецк Дьулуццоф — юочувчтз хщбя мы шубължжуй чкатз нкалрдьбвл, чээб фмпбь пешкгф дцн оммюьдфрщращий авъенэ сжнк, этыркрлкюдугъсй ьа нофьу.Н рпцучьэотр ркцвъркёинапбск бщяьма то «мъзкчкъвёш пърэгечь», м щоюоыэм бркьиюсй цанедонфе.Ъкеь, пычеужкн к эвщумя уччрлюдумя оэеу, энщра гуматнупб србй ёутич.Умя нпвююнщ цдрсж.Эн ъдшэвьечунщо вввэтмвею схэрмь уц - зл счурюи щбцл и шулъвхэсюь уц - зл бщъьдонэ вщичонфя, ъяицомонщонэ к щечв. Оюпыовчяйаь ща мэйщу, Кьдьеф Почкщьсциф эсюамъярт ьрой бпяешешьуй жпьу Читв съ смэиш оэеош и ьусюрщш, кщясьох Мкяьрй, м гашицкнъм уыещиу Ъыэып Соьы.Псо ътпе, грнпяач - ашжеа кшнзз Нущочаф Онпрпувфч Лэлцошакфй, мэт яжп ьеэкщъьцо цут метрырзоьо тимфт н смэеш ичунфи.Щь оюлуёартьн пьячэтъй ьрофх ьвжпешчй, эуыэвъсэкю ф сэяоооьбьй.Ит авъеф тогеыч ощ хщёею вщапфткбь ямшвю пемвшцу, ъээюочв злсэовчяпб злнуыаюььн ес мкбешаэчкъй.Ьомл жп щнкжшо Млржн брзюынъ липию смэеоо щбцл и ляаюа, щьа ъчпьь гуматниэулзнк ч нлбщхнл.Пыэщляьк с цнйцеш Аштрреч, энл унэвлрурарт псо нзйбь фкщькя.Нпцапоцсо по збооо, Чорзя ъэлячкут ыиькмъ оэ авъеф доьогуй ыоояуои Смлф Ккяаоишэй, цоээрля ъчшрт щ бош, чээ, пъ сцвхлм, хьяуь Мосфлуш хъчпб жрнубь ща шуй эвщугъ сёьа Лнкбочя.", 5, "Russian")]
       // public void FindKeyLengthTest(string data, int length, string language)
       // {
       //     KasiskiExamination test = new KasiskiExamination();
       //     int result = test.FindKeyLength(Utils.TrimText(data, language));

       //     Assert.AreEqual(length, result);
       // }

       // //[TestCase("UTPDHUG NYH USVKCG МУСЕ FXL KQIB. WX RKU GI TZN, RLS BHZLXMSNP KDKS; СЕВ Ш HKEWIBA, YYM SRB PER SBS, JV UPL О UVADGR HRRWXF. JV ZTVOOV УН ZCQU У UKWGEB, PL UQFB Р FOUKCG, TBF RQ VHCF R KPG, 0U КЕТ ZCQU MAW QKKW ZGSY, ЕР PGM QKETK UQEB DER EZRN, MCYE, MG UCTESVA, WP КЕТ ZCQU MAW KOIJS, LCOV NTHDNV JPNUJVB Ш GGV RWX ONKCGTHKFL XG VKD, ZJM VG CCI MVGD JPNUJ, RLS EWVKJT ASGUCS MVGD; DDK VG NYH PWUV CCHIIY RD DBQN RWTH PFRWBBI VTTK VCGNTGSF FL IAWU XJDUS, HFP VHSF, RR LAWEY QDFS RVMEES FZB СНН JRTT MVGZP UBZN FD ATIIYRTK WP КЕТ HIVJCI; TBF BLDPWPX RWTH ULAW TG VYCHX KQLJS US DCGCW OPPUPR, VG KFDNUJK GI JIKKC PL KGCJ lAOV KFTR GJFSAW KTZLZES WG RWXWT VWTL WP XPXGG, CJ EPOS VYC BTZCUW XG ZGJQ PMHTRAIBJG WMGEG. JZQ DPB JVYGM ZCLEWXR:CEB lAOV NYH JIKKC TGCWXE UHE JZK. WX VCULD YTTKETK WPKCGVCWIQT PWVY QEBFKKQ, QNH NZTTWIREL IAS VERPE ODJRXGSPTC EKWPTGEES, GMCG TTVVPLTEEJ; YCW WV NYH TZYRWH LOKU MU AWO, KEPM VG BLTP VQN RD DSGG AWKWUKKPL KGCJ, XY GPP KPG ONZTT ICUJCHLSE KET DBQHJTWUG. DYN MVCK ZT MEWCW HTWE ED JL, GPU YAE CH LQ! PGR UE, YH MWPP RXE CDJCGOSE, XMS UZGJQJL, SXVPN HBG!", "English")]
       // //[TestCase("СЪСШ ЩГЖИСЮБЩЫРО ФЧ РЛЫОУУПЦЛЫ ЦЙУБЭЫФСЮДЯ ЛКЧААЮЦЩДХИЯ Б ХЙЕУЖ ШЩ ЧЙХК ЯПУЩА УОРЧЙ ЧЬЩ ЬЙЬЩУЙЙЧ Е ПЛЖЮС ЧАХОИ ЩЦ ЛЩДФСНБЮСЛ Щ ЙККЦЖЦЛЩ ЭЙСНШТ ЩЧЫОВХЮДИ ЗЗН ЛЪЯД ЛЕЖОН ЕЮЧЪЛМСРТЖЦЬВЖ ЛГСЗЙЬЧШ НФЧЗ ЧЮАЮЕ ЛЖЙКУАХЙНАИЕЬВ ЙЦЛ ККФЩУЮИЙЧ З ЬЦСЙВГЫХ СОЗЖЪНШШО ЛЪЯД ЦСЗНКЕШЛГЫХ ЦЩЗШО ЦСПЛЛТП С ЧАХЙВЩ ЮЙЦСЗХФС КЗСАХЦЩ СЙФФЗШО ЛЪЯД РЛЬНГЫХЪЖ ДПХЛЕЗ НФЧГХЛ ШЙ ШУЩ ЮОЕЛХЧУЛУ ЩКЯЙЛЩНКЫЭА ЕЧРЮЗЫГЧЖФЖ ЩЦ ЧРШЙЛЩМ ДЛВОЖЫРО КЙЯЛЫОЖЧЖФПШЙЪНХ ХЙЕЩЖ СЪСШ СЬЛРНГ ШПРТЗПЗН ЧЕЧУЦЖЪЕЩУС РЫСОНШЙ ЩЩТЖЛТЕЗ СЪСПХЛ СПРЬЛЕСЧШЙЪНХЩ ЪЙУЖЫЬЛ ЯЧВАЕЧИ ЩРЩТ ОЕФЖЫХЪЖ ДХЩЩЩХОВХЮДФ ЩРЩТ Щ ЗМУВ ЫЩГЕПЫЛЖПЯЛЩ Е ШУБЭЫЛЯЖ ЛЩДФСНБЮСЖ ШПБВЩ КЛЩА УОРЧЙ С ЛЪЯД Р ЮЯЙЭЩИЙЯЩ ЭЧНЛЯДФ ДЙРЧБЩЫРО ЫФЖ НЖЫФМ ЕРУЛКФТЕЗ У ЬЩУ ЧНШЙЪЖЧКИ ЧЩЫЙЕЧЗАФДЭСФ ЮЙНЭЩСЦТА З СЪСШ РГФПЛТ З ЙЪЬЛЕО ЛР ИОСЩХ АФЧЭЧ ЩЮЯОЧАИОЬШЙО ЦСЙМУБУХЬЛЖ ЪЩНЖЩСБЮСФ НЗНГЯХСЮАКУЛА ЬЙЧБМС Л ГЖФФШПШУБЕФФШЮЧФ ЛЪЬЮАЮСФ НИИ ДЛЯЧЫЛ ЙЩЪБЮСОЛЕЙЬШЙТ СЩЬЦЛ НЖЫФМ Е НФЧКУЩЕ КЙЧК ЮОЩФЦЧЧЩУЧ УБЬЦЩЛЪЩГЖЗО ЛЪЯ ЫГЯ ЭЙЕ ЧЙФПЯЙ ШУЩ ОЫЛР АЪВЛЕСЖР ЪЬЧАХ ЧААКШФЦЖЦГ НЖЫЖЕ ЕЧОЕЙПЬЛКЫП ЩЮЫФСЖЪЬЛТ С РЛЫОУУПЫФТГЦЩМ ЫОЖЧЖФПШЙЪНЩ УЦЩЪЙЧАСПРЛА ХСЦЛЕ ЛЛНЙЛ ЗЛЯХ ЛЪЯ ЦФЩЬКФУЮЧ ЕБЭ ЦФЩЬКФУЮЧ ЯШЙМЩЛЪЩГЖЗО СЩЬЦЛ ЯЙЫЩСАЗ ЩШЗ ЧНСППГЫХ УГЯ ЮОЛЖЪОСШЙ ХЬЛРЧЩФЯЙОЩЖ ЦФДУЧНСД ЦГ ЗЮОЫШЩЗ РРЙПФДХЕ ЛЪЯ ЧЧШЙМЩ ЧЗШГ ЕЙНФТЗ", "Russian")]
       // //[TestCase("босэоьыыф ачолуз, босэоьыыф къцпэокыацис — ьдун тх мртштон къцпэокыацисо, оьншрынаизифсй ыа ърптпщлшфешит ь сющпятномонуи чутыимцацьчьгщ сьотусьцчрсфьгщ ркяпыеоулрнтн оэдпщьшыя яичвшщон и тг пщсхудщвкаецьчьсэеу шах в шакыыььм эефятр, ткш и н штврщтпшсэе, фьтщршу, с эобыоьтжм дщ зкъешы ыцмнохьв, муоут ьояюашяькск в щюобеыяе гиююоначця у дпжияршраший. бпыогёынщ, чкятщтчйй лнкщит пъудъохоглеь, етщ чкятщтк эоквхунуя содлнчьй муфры ллюовутк р дщсьотщччь дцичыыа тпшсэая ьдша т аа се ощя ыасыыа тпшсэом ьдшонь ятыфо.пыи заоч, в ыщувап ъошокщфлвтанщгш жияршраший, усци м жияршаехсьу бюдпа суммьл ь ачолщгтенщй мурщяьыоьтжм пщямщеший, ао чорыо ърптпщлшфиэь, бао щн т нвцяпаск уфозлнчьй тавцфыомоншоу пухвшч.ашахьгуччйе ыаыяусдпыик пъцмрнймтья ф пиоркъмлм(орумуфрешнеъ пщсхудщвкаецьчьсэяц), аругъомчац ц т.п.в ыщувап эоцикщфлвтанжх вцфыом. ъеэоо еаьтшанщгш шрупььашахцзл исреьтпы с IX нефо (рлбшаы лл-фцнпи), яьтк нкцбщлпу итвпятшыц ялючкум ргш эрумпыеший р ррахкнщй рцзши, мьзчорыо, квхнеэсй тегиююонкк угуппасхия цеыонщияом ф.-ф.гацэоцьшыоч в 1822 ньдю.в ябдщжпятнечыоф лтаеыаьбрр нкцбщлпу итвпятшыцц уъоццнлнтнму ямщяйтын рлсышаты «сьлщтшч жюк» зтглрк эо, «ълйжудип еецомучхи» фьнлн оьйця, к аахжп юочач «теэи фопуткыа оркытл» жищь неъыа.шабцнля ы яеыеоцнж XX впша мохкшуныавщ иыэоцьсбечыя олооъцтчом жияршраший юатркпаэымоюэсй бсэоуеиныцц к ваыаоэншъу хртэтщачолузэ, эоитшъу щн щюичечнеэсй р оьншрнщм м эрщцпяср олбчрнтн бюдэзиа къцпэонюаяом", "Russian")]

       // [TestCase("Оуйэтмче щавчнлеэая э пычёша ю юрфбцчжсншэй фмъурлтычцж Ашьы Ыамъоннё Жеьеы, сдр мё рипич реэь мйсдиф аврт Ъутррлвроа. Збою пычёш ямъяртьн снопсо ьооо эцсъэзфцууй: удпаь шы тьацоччмэя ьэ мщончмф нкчбълпу влжшймф гпяокму яошашо. С прюсох сээрънё, юрфёч нвчяпбск сыудэтмэм баыокюеычсюихч «вжсгугъ олзеэтмо», съпщатлвуыооо ь «гашуьэвэкуы омщпатноч» (О. С. Орупордщр «Гърп эт ямк»), пеуныовэтмунщонэ и чжурооо. Мае ыруухлвгче фщюб вжгщту плй аемя м юочетьыб зшокъмьбвлх, хэтърёу ощи чэгят товрсэч у Деыур. Юах, щнкзй Раэицчя ноцьурт ьвдзбк угъ дпбех, кщбоьыч эн эткяартьн уэтыэиюь мйгъдшйй мркщ, а Прюпевккн пьипцжлеэ яапи ээгъ, чээбж унэвърубь цнйця Наьчлфя ъэхчоъэтлтж ца рё ьйнл. Пщщауаэулзнщш чррээй квцнеюсй яиюукъ пьимутэтмэвлнун нфкщыу ще уцврсэьох и шчкъмю ье щусьох трбудку (гр. ma tante). Щихбо фз нэсюеф ье ункут, цтщ энл ткщак, и шу хъчпб с щеф яаугщраьимотз, нщ ьаьугчтз нпюиэашйе уахэнж смутэкщсо ъбдусювк энф нп ыооуэ. Ьа ыёьбръм яэнр гщатрй Кьнж Шпяеь вётечяибск дмо пррьэнлжк: Онпрпш Бълхэнэкуш и Ыьпя Брзюдон. Ошч пьоэчвъпщатлвцунж вёашрмю авртю, щац Чкекфй ъяоюимэпъсэовчеш «гашуьэвэкщыу ъбдусювю». Почьгчнэтмэ рлзнэвърщр нл эээм мацв пъсмнщрнщ юочиэчкр и няяпудуй нофье э Нкюочещьош, кщбоьонэ нлзёрайт «хэрэихонэкуы чядщриееч». Юрф эээм моцкшфньбвъ дуолъгщр гъсэнмф вптёюсй ьа аркьцязьщош. Нпамътын нл смэи ъбпзащий Почкщьсцочв нр еттиюь х Щуьанчня, Пжур эркцу те ъэсче щбързоо Ащдыуя ътъяанлйутэя эвдл.Ашотълж Щуьанчн — эыш щнкзй Раэицчя Цуыогфнк, тоэткрлкюдчй рмю ынъгщ ьеядщпсюв эум, гтщ юоэтщннщо мудст ыозоуцкняю счзщь у брлтуб дрнжси ътбо.Пъсцу снопсо нотррлщпьик ит - ца оркьивы Ъкеь пщатъяшьо ырщропиэ авъё мяешя м щошпкьиф Кюяаоишо вшеьбе э Дщъобомйм ф дывгфму эффцпяаши.Зба титьь эомурдешьо ще ъэдбоочт Метвхъвю, эбчаооюеечв възмйшрншэй пугэй, поляыш спядвеч ч сыоьэбщоьбяши ьбаюь оуйэтмчтрлжьо нлунтрлжьыш чпъонехэм, ыруьоэиэк пължцу ъбдусювю.Эчррптнже «ъяицлиёещий» Онлтщъя, Ыьпяа ф Дщъобомо злккьчфвкмтэя эум, гтщ энф гоу - тъ ркцдъбёъи тимэгъ мптврдй, ьаыунолф ич ыочоойх лкэяиэ, а хэгпа ъяирхкъа ыоцчцфя уд ущичотз, ошч «пъйчолф кморюацкнъгщ, юрфвйцачи псо эпуьох к чуднеом и ыуьбичи чуднеон в Шофщу; шеорепь ъъанапб, а цвкятллжьых нк ьёш». В убоое, Ъкеь бёъ оюпыовчеш р Мъсхру, Поцэхъв ыозтацэвлн м аочдкбы, л дпъо э Ашотълпы клк - ээ злмйъ еоо щбев. Ит Юеюеыпуьгк техсэрир ппяещоьчтэя м Ыоэкмв нл ичунфнё срлфуьи Ьоьбоноф ч ес дщёеьи Шотлшу.Цдрсж ыы ункщошичая эо маех спыьрй Ыэсюомйх: оркгищеф Ьаюацкех Рщатъвщш, ес мюхеш гыофъм Уъьрй Ыэсюомйм, фх оутзму: Реьоф, Ьицоцоеш, Нкбадеф ч Пртпш, а юаххе ылпыящнуеех гыоффну Аощеф.Эбэткьонкк р срмжу Ръсээвжх ъяоюимэпъсэовчяпбск пычёшу Гуррр: ттеэь мае ырщзе, фсхяещнпш, дъбыуй.Удпаь те товкзёрайтьн дне цмбъвшйе чишчи: Эошн и Щихэллй Ыэсюом, Ьаюаго и Моычс Прюпевкщш. Сънй ч Нфкщъах пёбайтьн сцрёраюь ьроф оэьодешчя ът маеб, ткщ клк уд лйбщрь ще чэжрт ъяинеьби щи х ёешу аэръшпыу, неок Сънй бръюыэдщай аеэтыо Нфкщъак.Нщ Ьицоцой ътъяанлйутэя шо въйшв, и Эошн нр мщхею соуртаэк сноуд счет.Энл иьщррншу пррпхинапб зл нпсо.Ьатсоноы авъеф бръюыэдщоф аеэтый и ъдшэвьечунщо цвчдеф юопрюси эо ьрофм ляаюоч, о тлксу иб пщеечуф рипиэ Ьаюаго Ръсээвл.Ошо тъжп догеэ ъюмиэк къгщ - бо, ыозбошу шопьагчвлеэая ща щбкьомунщыф яаугщроь с Лэрфсщы и вецвею енэ.Пьаттнфк ъяопоцхартьн.Нл нры тлксу пьиьвтэтмвею Пжур Метвхъв, хэтърёш зпеьк зщахэмфтьн с эомаеш юшэй Щаэошрй Ыэсюомэй.Ыруузтапб Млржн Дшиэяирвшо Абрщаишомо — огешк вчийбечьшоя ф уможлечоя тешзища.Ъяацтуёеэку рср пычсятьбвяюдче мойбск ер ца эмпъоэтж ч ррзхэсюь пф сяжоунфй у рыэккцынашчй.Ыркцдщих р слмщы рлзнорр.Гыоф Ьоьбон ткьцяеэ авъй цмбфмёш тлнпе — «Длнуъу Цуъэрл» с Кдръсуыоноф. Р эюо мяешя м Ыоэкму лржуб пьи ьыеьту атлрёш гьая Пеууаэв — нлктечеб эгьочьооо ьэсюойьик и щбев Пжурл.Кшнзз Вкаичиф, нвчяйаь ьооатнешьицоч Пеууаэвл, нкёищапб бържпу уа шосчеоатно.Хяоше шугъ нк ьаэлптсювщ бацжп юрртпьдяюэ щнкжшй Млмщьтъвё, щоюоыйе нмпатр с хьяуеч Раэицчеш Кюяаоишйм квцнююсй аашычч бчитщиши ыэдэтмунщихомф гыофл.В лэрзбю бацжп рмршурартьн и цнйсищя Ояумебщак — мкбь Моычсл.Дпъо ъсцэжщяпбск тпы, чюо м авъёч цанедонфи няаа пужею ичюеьаээря с ъяоэьлэй язкщощиэк Пзеыо(Пзеы нвчяпбск нпцацошьыш сёьош гыофл и луз итщш пьобудярё ье шосут ыоцвчфтж ьаэлптсювщ) ч злвпзарт маё рмю.Юллн хьяуя Мосфлун съсээию в ээм, гтщпы януётъжубь уамущлнуу и нср ьаэлптсювщ юопецчтз мпхдя смэиш спыехсэрош и хьятнкыи.Вецк Дьулуццоф — юочувчтз хщбя мы шубължжуй чкатз нкалрдьбвл, чээб фмпбь пешкгф дцн оммюьдфрщращий авъенэ сжнк, этыркрлкюдугъсй ьа нофьу.Н рпцучьэотр ркцвъркёинапбск бщяьма то «мъзкчкъвёш пърэгечь», м щоюоыэм бркьиюсй цанедонфе.Ъкеь, пычеужкн к эвщумя уччрлюдумя оэеу, энщра гуматнупб србй ёутич.Умя нпвююнщ цдрсж.Эн ъдшэвьечунщо вввэтмвею схэрмь уц - зл счурюи щбцл и шулъвхэсюь уц - зл бщъьдонэ вщичонфя, ъяицомонщонэ к щечв. Оюпыовчяйаь ща мэйщу, Кьдьеф Почкщьсциф эсюамъярт ьрой бпяешешьуй жпьу Читв съ смэиш оэеош и ьусюрщш, кщясьох Мкяьрй, м гашицкнъм уыещиу Ъыэып Соьы.Псо ътпе, грнпяач - ашжеа кшнзз Нущочаф Онпрпувфч Лэлцошакфй, мэт яжп ьеэкщъьцо цут метрырзоьо тимфт н смэеш ичунфи.Щь оюлуёартьн пьячэтъй ьрофх ьвжпешчй, эуыэвъсэкю ф сэяоооьбьй.Ит авъеф тогеыч ощ хщёею вщапфткбь ямшвю пемвшцу, ъээюочв злсэовчяпб злнуыаюььн ес мкбешаэчкъй.Ьомл жп щнкжшо Млржн брзюынъ липию смэеоо щбцл и ляаюа, щьа ъчпьь гуматниэулзнк ч нлбщхнл.Пыэщляьк с цнйцеш Аштрреч, энл унэвлрурарт псо нзйбь фкщькя.Нпцапоцсо по збооо, Чорзя ъэлячкут ыиькмъ оэ авъеф доьогуй ыоояуои Смлф Ккяаоишэй, цоээрля ъчшрт щ бош, чээ, пъ сцвхлм, хьяуь Мосфлуш хъчпб жрнубь ща шуй эвщугъ сёьа Лнкбочя.", "Russian")]
       // public void DecryptVigenereCipherTest(string data, string language)
       // {
       //     KasiskiExamination test = new KasiskiExamination();
       //     KasiskiExaminationResult result = test.DecryptVigenereCipher(data, language);
       //     Debug.WriteLine(result.Plaintext);

       //     Assert.NotNull(result.Plaintext);
       // }

        //[TestCase]
        //public void Foo()
        //{
        //    // File.WriteAllText("F:\\Test.json", "KOALA");
        //    string path = "The Adventure of the Dancing Men.txt";
        //    string content = File.ReadAllText(@"f:\VisualStudioProjects\CSoDS_1\VigenereCipherTests\bin\Debug\" + path);

        //    List<char> separators = new List<char>();

        //    for (char i = char.MinValue; i < 0x3000; i++)
        //    {
        //        if (char.IsWhiteSpace(i) || char.IsPunctuation(i))
        //        {
        //            separators.Add(i);
        //        }
        //    }
        //    List<string> words = new List<string>(content.Split(separators.ToArray()));
        //    words.RemoveAll(str => str == string.Empty);

        //    KasiskiExamination kasiski = new KasiskiExamination();
        //    VigenereAlgorithm alg = new VigenereAlgorithm();
        //    Random rnd = new Random();
        //    int count = words.Count;
        //    string language = "English";

        //    List<ExaminationInfo> totalTestResult = new List<ExaminationInfo>();

        //    for (int countOfWords = 5; countOfWords < 1002; countOfWords+=5)
        //    {
        //        for (int i = 0; i < 100; i++)
        //        {
        //            int skipCount = rnd.Next(0, count - countOfWords);
        //            string keyword = "KEYWORD"; //words[rnd.Next(0, count)];

        //            string plaintext = string.Join(" ", words.Skip(skipCount).Take(countOfWords));
        //            string ciphertext = alg.Encrypt(plaintext, keyword, language);

        //            KasiskiExaminationResult result = kasiski.DecryptVigenereCipher(ciphertext, language);

        //            totalTestResult.Add(new ExaminationInfo
        //            {
        //                WordsCount = countOfWords,
        //                IsMarkedAsCorrect = result.Keyword != null,
        //                IsKeyLengthCorrect = result.Keyword?.Length == keyword.Length,
        //                IsDecryptedTextCorrect = result.Plaintext == plaintext
        //            });
        //        }
        //    }

        //    string json = JsonConvert.SerializeObject(totalTestResult);

        //    Debug.WriteLine(DateTime.Now.ToString("T"));
        //    File.WriteAllText("F:\\Test.json", json);
        //}

        // [TestCase]
        public void FooDraw()
        {
            string json = File.ReadAllText("F:\\Test.json");
            List<ExaminationInfo> info = JsonConvert.DeserializeObject<List<ExaminationInfo>>(json);

            var sorted = info.GroupBy(x => x.WordsCount);

            List<string> keyLengthList = new List<string>();
            List<string> plainList = new List<string>();

            foreach (var wordCount in sorted)
            {
                double keyLength = wordCount.Average(x =>
                {
                    if (x.IsMarkedAsCorrect)
                    {
                        return x.IsKeyLengthCorrect ? 100 : 0;
                    }

                    return 0;
                });

                double plainText = wordCount.Average(x =>
                {
                    if (x.IsMarkedAsCorrect)
                    {
                        return x.IsDecryptedTextCorrect ? 100 : 0;
                    }

                    return 0;
                });

                keyLengthList.Add($"{wordCount.Key},{keyLength}");
                plainList.Add($"{wordCount.Key},{plainText}");

            }

            string len = string.Join(Environment.NewLine, keyLengthList);
            string plain = string.Join(Environment.NewLine, plainList);
            Debug.WriteLine(len);
            Debug.WriteLine("");
            Debug.WriteLine(plain);
        }

        [TestCase]
        public void Bar()
        {
            // File.WriteAllText("F:\\Test.json", "KOALA");
            string path = "The Adventure of the Dancing Men.txt";
            string content = File.ReadAllText(@"f:\VisualStudioProjects\CSoDS_1\VigenereCipherTests\bin\Debug\" + path);

            List<char> separators = new List<char>();

            for (char i = char.MinValue; i < 0x3000; i++)
            {
                if (char.IsWhiteSpace(i) || char.IsPunctuation(i))
                {
                    separators.Add(i);
                }
            }
            List<string> words = new List<string>(content.Split(separators.ToArray()));
            words.RemoveAll(str => str == string.Empty);

            KasiskiExamination kasiski = new KasiskiExamination();
            VigenereAlgorithm alg = new VigenereAlgorithm();
            Random rnd = new Random();
            int count = words.Count;
            string language = "English";

            List<ExaminationInfo> totalTestResult = new List<ExaminationInfo>();

            for (int countOfWords = 150; countOfWords < 151; countOfWords += 5)
            {
                for (int keyLength = 1; keyLength <= 70; keyLength++)
                {
                    for (int attempt = 0; attempt < 100; attempt++)
                    {
                        int skipCount = rnd.Next(0, count - countOfWords);
                        string keyword = GetKey(keyLength, rnd);

                        string plaintext = string.Join(" ", words.Skip(skipCount).Take(countOfWords));
                        string ciphertext = alg.Encrypt(plaintext, keyword, language);

                        KasiskiExaminationResult result = kasiski.DecryptVigenereCipher(ciphertext, language);

                        totalTestResult.Add(new ExaminationInfo
                        {
                            KeyLength = keyLength,
                            IsMarkedAsCorrect = result.Keyword != null,
                            IsKeyLengthCorrect = result.Keyword?.Length == keyword.Length,
                            IsDecryptedTextCorrect = result.Plaintext == plaintext
                        });
                    }
                }
            }

            string json = JsonConvert.SerializeObject(totalTestResult);

            Debug.WriteLine(DateTime.Now.ToString("T"));
            File.WriteAllText("F:\\TestKeyLength.json", json);

            var sorted = totalTestResult.GroupBy(x => x.KeyLength);

            List<string> keyLengthList = new List<string>();
            List<string> plainList = new List<string>();

            foreach (var wordCount in sorted)
            {
                double keyLength = wordCount.Average(x =>
                {
                    if (x.IsMarkedAsCorrect)
                    {
                        return x.IsKeyLengthCorrect ? 100 : 0;
                    }

                    return 0;
                });

                double plainText = wordCount.Average(x =>
                {
                    if (x.IsMarkedAsCorrect)
                    {
                        return x.IsDecryptedTextCorrect ? 100 : 0;
                    }

                    return 0;
                });

                keyLengthList.Add($"{wordCount.Key},{keyLength}");
                plainList.Add($"{wordCount.Key},{plainText}");

            }

            string len = string.Join(Environment.NewLine, keyLengthList);
            string plain = string.Join(Environment.NewLine, plainList);
            Debug.WriteLine(len);
            Debug.WriteLine("");
            Debug.WriteLine(plain);
        }

        private string GetKey(int length, Random rnd)
        {
            List<char> list = new List<char>();

            for (int i = 0; i < length; i++)
            {
               list.Add("ABCDEFGHIJKLMNOPQRSTUVWXYZ"[rnd.Next(0, "ABCDEFGHIJKLMNOPQRSTUVWXYZ".Length)]); 
            }

            return string.Concat(list);
        }
    }


    public class ExaminationInfo
    {
        public int WordsCount { get; set; }

        public int KeyLength { get; set; }

        public bool IsMarkedAsCorrect { get; set; }

        public bool IsKeyLengthCorrect { get; set; }

        public bool IsDecryptedTextCorrect { get; set; }
    }
}